export default {
    // 测试返回的数据- 厕所管理 - 腾讯地图 -模拟数据 
    lat: "24.815763", //中心点坐标
    lng: "103.325472", //中心点坐标
    mapdata: [
      //厕所的坐标和类型
      {
        id: "1",
        title: "测试1-等级厕所",
        type: "1",
        lat: "24.815763",
        lng: "103.325472"
      },
      {
        id: "2",
        title: "测试2-水冲",
        type: "2",
        lat: "24.815273",
        lng: "103.325478"
      },
      {
        id: "3",
        title: "测试3-旱厕",
        type: "3",
        lat: "24.815734",
        lng: "103.325876"
      },
      {
        id: "4",
        title: "测试4-正在建设",
        type: "4",
        lat: "24.815600",
        lng: "103.325372"
      },
      {
        id: "5",
        title: "测试5-规划建设",
        type: "5",
        lat: "24.815500",
        lng: "103.325478"
      },
      {
        id: "6",
        title: "测试6-拥堵厕所",
        type: "6",
        lat: "24.815400",
        lng: "103.325876"
      }]
}