export const geoCoordMap = {
  昆明市: [102.912251, 25.940609], //
  曲靖市: [103.997851, 25.501557], //
  玉溪市: [101.843907, 23.750461], //
  保山市: [98.667133, 25.111802], //
  昭通市: [104.717216, 27.536999], //
  丽江市: [100.833026, 27.072108], //
  普洱市: [100.572344, 23.077321], //
  临沧市: [99.08697, 23.886567], //
  楚雄彝族自治州: [101.546046, 25.041988], //
  红河哈尼族彝族自治州: [102.684182, 22.966775], //
  文山壮族苗族自治州: [104.24401, 23.96951], //蓝色
  西双版纳傣族自治州: [101.197941, 21.801724], //
  大理白族自治州: [100.525668, 25.389449], //
  德宏傣族景颇族自治州: [97.878363, 24.436694], //
  怒江傈僳族自治州: [98.954304, 26.850949], //
  迪庆藏族自治州: [99.906463, 28.026853] //
}
export const geoCoordMap1 = {
  昆明市: [102.612251, 25.340609],
  曲靖市: [103.597851, 25.701557],
  玉溪市: [102.643907, 24.250461],
  保山市: [99.267133, 25.211802],
  昭通市: [103.517216, 27.436999], //红色
  丽江市: [100.73026, 26.572108],
  普洱市: [101.072344, 22.877321],
  临沧市: [100.18697, 23.986567],
  楚雄彝族自治州: [101.646046, 25.841988], //
  红河哈尼族彝族自治州: [103.484182, 23.466775],
  文山壮族苗族自治州: [105.34401, 23.46951],
  西双版纳傣族自治州: [100.897941, 22.101724],
  大理白族自治州: [100.225668, 25.989449],
  德宏傣族景颇族自治州: [98.078363, 24.936694],
  怒江傈僳族自治州: [98.954304, 25.950949],
  迪庆藏族自治州: [99.106463, 28.026853]
}
export const geoCoordMap2 = {
  // 绿色
  昆明市: [103.012251, 25.240609],
  曲靖市: [103.897851, 26.001557],
  玉溪市: [101.843907, 24.150461],
  保山市: [99.267133, 24.611802],
  昭通市: [104.017216, 27.636999],
  丽江市: [100.333026, 26.972108],
  普洱市: [101.072344, 23.877321],
  临沧市: [99.68697, 23.986567],
  楚雄彝族自治州: [101.846046, 25.341988],
  红河哈尼族彝族自治州: [102.684182, 23.466775],
  文山壮族苗族自治州: [104.34401, 23.46951],
  西双版纳傣族自治州: [100.397941, 21.801724],
  大理白族自治州: [99.625668, 25.689449],
  德宏傣族景颇族自治州: [98.278363, 24.536694],
  怒江傈僳族自治州: [98.954304, 26.450949],
  迪庆藏族自治州: [99.406463, 27.426853]
}

export const dataList = [

  {
    name: '曲靖市',
    value: 339
  },
  {
    name: '玉溪市',
    value: 412
  },
  {
    name: '保山市',
    value: 429
  },
  {
    name: '昭通市',
    value: 389
  },
  {
    name: '丽江市',
    value: 352
  },
  {
    name: '普洱市',
    value: 329
  },
  {
    name: '临沧市',
    value: 532
  },
  {
    name: '楚雄彝族自治州',
    value: 299
  },
  {
    name: '红河哈尼族彝族自治州',
    value: 139
  },
  {
    name: '文山壮族苗族自治州',
    value: 440
  },
  {
    name: '西双版纳傣族自治州',
    value: 89
  },
  {
    name: '大理白族自治州',
    value: 652
  },
  {
    name: '德宏傣族景颇族自治州',
    value: 415
  },
  {
    name: '怒江傈僳族自治州',
    value: 329
  },
  {
    name: '迪庆藏族自治州',
    value: 752
  }
]
